Обработки/Reports/_ВыгрузкаПартийДляТрадиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ВыгрузкаПартийДляТрадиции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ВыгрузкаПартийДляТрадиции/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Выгрузка партий для Традиции", 
		"0.03", 
		"", 
		Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
		
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ДанныеДоговора()
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	СчетаДоверительногоУправления.НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения
		|ПОМЕСТИТЬ _КлиентДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_КлиентДУ.НомерДоговора,
		|	_КлиентДУ.ДатаЗаключения КАК ДатаДоговора,
		|	РеквизитыКлиентаСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеСчетаДУ
		|ИЗ
		|	_КлиентДУ КАК _КлиентДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиентаСрезПоследних
		|		ПО _КлиентДУ.Клиент = РеквизитыКлиентаСрезПоследних.ЮрФизЛицо";
		
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Данные = Новый Структура();
			Данные.Вставить("НомерДоговора", СтрЗаменить(СтрЗаменить(ВыборкаДетальныеЗаписи.НомерДоговора, "/", "_"), "\", "_"));
			Данные.Вставить("ДатаДоговора",  Формат(ВыборкаДетальныеЗаписи.ДатаДоговора, "ДФ=yyyy-MM-dd"));
			Данные.Вставить("Наименование", СтрЗаменить(ВыборкаДетальныеЗаписи.НаименованиеСчетаДУ, """", ""));
			
			Возврат Данные;
			
		КонецЕсли;

КонецФункции		

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем старт операции
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,КлючТекущегоВарианта");
	
	Попытка
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
		
	КонецПопытки;

	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДата", ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтчетнаяДатаГраница", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	
	ДанныеДоговора = ДанныеДоговора();
	Если НЕ ДанныеДоговора = Неопределено Тогда
	
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				ДанныеДоговора.ДатаДоговора);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				ДанныеДоговора.НомерДоговора);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеСчетаДУ", 		ДанныеДоговора.Наименование);
			
	КонецЕсли; 
	
    ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	
	ТипыОпределяемыйТипПартия = "";
	
	Для Каждого ТипПартии Из Метаданные.ОпределяемыеТипы.Партия.Тип.Типы() Цикл
		ДокументСсылка = Новый(ТипПартии);
		
		ТипыОпределяемыйТипПартия = ТипыОпределяемыйТипПартия + ?(ПустаяСтрока(ТипыОпределяемыйТипПартия),"",", ") + "ТИП(Документ." + ДокументСсылка.Метаданные().Имя + ")";
	КонецЦикла;	
	
	МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос, "ТИП(Документ.Сделка), ТИП(Документ.ИсполнениеОбязательствПоСделке)", ТипыОпределяемыйТипПартия);
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	//РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект,ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка,);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	

КонецПроцедуры
